using ProjApp.Database.EntitiesStatic;
using ProjApp.ProtocolForms;

namespace Project1Tests.DocumentProcessor;

public static class DummyDavlenie1Data
{
    public static DavlenieForm DavlenieData2Eta()
    {
        var date = new DateOnly(2025, 01, 02);

        return new DavlenieForm
        {
            Address = MKAIRInfo.GetAddress(date),
            ProtocolNumber = "03/052/25",
            DeviceInfo = "Датчики давления Метран-150; 232.30.160",
            DeviceTypeNumber = "32854-09",
            DeviceSerial = "0001208081",
            ManufactureYear = 2013u,
            Owner = "ООО \"РИ-ИНВЕСТ\"",
            OwnerINN = 7705551779,
            VerificationsInfo = "НКГЖ.406233.028МП «Преобразователи давления измерительные АИР-20/М2. Методика поверки (с Изменением № 1)», утвержденному ФГУП «ВНИИМС» 22 июня 2020 г",
            EtalonsInfo = "73828.19.1Р.00156416; 73828-19; Калибраторы многофункциональные; ЭЛМЕТРО-Паскаль-03, Паскаль-03; нет модификации; 0050; 2020; 1Р; Эталон 1-го разряда; Приказ Росстандарта от 01.10.2018 №2091; свидетельство о поверке № С-ВЯ/28-12-2023/305125031 от 28.12.2023г. действительно до 27.12.2024г.73828.19.1Р.00156416; 73828-19; Калибраторы многофункциональные; ЭЛМЕТРО-Паскаль-03, Паскаль-03; нет модификации; 0050; 2020; 1Р; Эталон 1-го разряда; Приказ Росстандарта от 01.10.2018 №2091; свидетельство о поверке № С-ВЯ/28-12-2023/305125031 от 28.12.2023г. действительно до 27.12.2024г.",
            Temperature = 22,
            Humidity = 0.42,
            Pressure = "101,8 кПа",
            Checkups = new Dictionary<string, string>
            {
                ["Результат внешнего осмотра"] = "6.1",
                ["Проверка герметичности системы"] = "6.2",
                ["Результат опробования"] = "6.3",
                ["Проверка электрической прочности и сопротивления изоляции"] = "6.4-6.5",
                ["Определение основной приведенной погрешности и вариации"] = "6.6-6.7",
            },
            MeasurementUnit = "МПа",
            PressureInputs = [1, 2, 3, 4, 5],
            EtalonValues = [6, 7, 8, 9, 10],
            DeviceValues = [[11, 12, 13, 14, 15], [16, 17, 18, 19, 20]],
            ActualError = [[21, 22, 23, 24, 25], [26, 27, 28, 29, 30]],
            ValidError = 0.2,
            Variations = [31, 32, 33, 34, 35],
            VerificationDate = date,
            Worker = "Большаков С.Н."
        };
    }
    public static DavlenieForm DavlenieData2Eta2()
    {
        var date = new DateOnly(2025, 01, 02);

        return new DavlenieForm
        {
            Address = MKAIRInfo.GetAddress(date),
            ProtocolNumber = "03/052/25",
            DeviceInfo = "Датчики давления Метран-150; 232.30.160",
            DeviceTypeNumber = "32854-09",
            DeviceSerial = "0001208081",
            ManufactureYear = 2013u,
            Owner = "ООО \"РИ-ИНВЕСТ\"",
            OwnerINN = 7705551779,
            VerificationsInfo = "ГСИ. Преобразователи давления измерительные EJX. Методика поверки",
            EtalonsInfo = "73828.19.1Р.00156416; 73828-19; Калибраторы многофункциональные; ЭЛМЕТРО-Паскаль-03, Паскаль-03; нет модификации; 0050; 2020; 1Р; Эталон 1-го разряда; Приказ Росстандарта от 01.10.2018 №2091; свидетельство о поверке № С-ВЯ/28-12-2023/305125031 от 28.12.2023г. действительно до 27.12.2024г.73828.19.1Р.00156416; 73828-19; Калибраторы многофункциональные; ЭЛМЕТРО-Паскаль-03, Паскаль-03; нет модификации; 0050; 2020; 1Р; Эталон 1-го разряда; Приказ Росстандарта от 01.10.2018 №2091; свидетельство о поверке № С-ВЯ/28-12-2023/305125031 от 28.12.2023г. действительно до 27.12.2024г.",
            Temperature = 22,
            Humidity = 0.42,
            Pressure = "101,8 кПа",
            Checkups = new Dictionary<string, string>
            {
                ["Результат внешнего осмотра"] = "6.1",
                ["Проверка герметичности системы"] = "6.2",
                ["Результат опробования"] = "6.3",
                ["Проверка электрической прочности и сопротивления изоляции"] = "6.4-6.5",
                ["Определение основной приведенной погрешности и вариации"] = "6.6-6.7",
            },
            MeasurementUnit = "МПа",
            PressureInputs = [1, 2, 3, 4, 5],
            EtalonValues = [6, 7, 8, 9, 10],
            DeviceValues = [[11, 12, 13, 14, 15], [16, 17, 18, 19, 20]],
            ActualError = [[21, 22, 23, 24, 25], [26, 27, 28, 29, 30]],
            ValidError = 0.2,
            Variations = [31, 32, 33, 34, 35],
            VerificationDate = date,
            Worker = "Большаков С.Н."
        };
    }
}
